import React from 'react'

const App = () => {





  return (
    <div>
      <h1>if Statement React-ში</h1>
      <p>`if` გამოიყენება JSX-ის გარეთ, რათა ლოგიკურად გადავწყვიტოთ რომელი ელემენტი დავაბრუნოთ. <br /> მაგალითად, თუ პირობა შესრულდა, ვაბრუნებთ ერთ JSX ელემენტს, თუ არა — სხვას. <br /> ეს მეთოდი კარგია უფრო რთული ლოგიკისთვის, როცა ბევრი პირობა გვაქვს.</p>
    
      <br />

      <h1>Ternary Operator (? :) React-ში</h1>
      <p>ტერნარული ოპერატორი არის მოკლე ფორმა `if-else`-ის. <br />გამოიყენება პირდაპირ JSX-ში, როცა გვინდა ერთი ხაზით გადავწყვიტოთ რომელი მნიშვნელობა გამოვიტანოთ. <br /> სტრუქტურა: პირობა ? თუ_შესრულდა : თუ_არ_შესრულდა <br /> იდეალურია მარტივი არჩევანისთვის, მაგალითად ტექსტის ან სტილის ცვლილებისთვის.</p>
    
      <br />
    
      <h1>Logical AND (&&) React-ში</h1>
      <p>`&&` ოპერატორი გამოიყენება JSX-ში პირობის მიხედვით ელემენტის გამოსატანად. <br /> თუ პირობა არის true, მაშინ გამოიტანს JSX ელემენტს. <br /> თუ პირობა არის false, არაფერს გამოიტანს. <br /> ეს მეთოდი კარგია, როცა გვინდა რაღაც გამოჩნდეს მხოლოდ კონკრეტულ შემთხვევაში.</p>
    </div>
  )
}

export default App
