'''თქვენი სასურველ რიცხვებს შორის შეასრულეთ და დაბეჭდეთ ოპერაციები, მინიმუმ 5 თითოეულ ოპერატორზე (+,-,*,//)'''

# ვასრულებ ჩემი სასურველი რიცხვების მაგაკlითებს და ვბეჭდავ

print(978 + 256)
print(3000 + 1100)
print(100 + 1000)
print(17 + 94)
print(87 + 684)
print('  ')
print(78 - 19)
print(34 - 31)
print(3699 - 509)
print(15800 - 15673)
print(87 - 33)
print('  ')
print(9 * 7)
print(11 * 45)
print(3 * 3 * 7)
print(7 * 44)
print(47 * 98)
print('  ')
print(1000 // 2)
print(789 // 56)
print(635 // 5)
print(48 // 8)
print(56 // 6)

