'''დაუშვით 5 სხვადასხვა შეცდომა. კომენტარების სახით მიუწერეთ რატომ მიიღეთ ის და გამოასწორეთ კოდი'''
#ცვლადის შექმნის დროს ცვლადი შიეძლება შეიცავდეს რიცხვს მაგრამ ცვლადის რიცხვით დაწყება გამოიტანს ე#2nd_dog = 'max'
second_dog = 'max'

#ცვლადის შექმნისას სიტყვების გამოსაკვეთდ შეგვიძლია გამოვიყენოთ ქვედატირე მაგრამ თუ ჩვენ გამოვიყენებთ სვხვა ნებისმიერ ზედმეტ სიმბოლოს მაგ:*, , -. გამოგვიტანს ერორს
#third dog = 'miki'
third_dog = 'miki'

#ჩვენ არ შეგვიძლია გამოვიტანოთ print ფუნქციის საშვალებით ცვლადი თუ ის არ არსებობს
#print(dogs)
dog = 'bubu'
print(dog)

#ბრძანებების უმრავლესობას სჭირდება ფრჩხილები (print(), input().) თუ ჩვენ არ დავუწერთ ფრჩხილებს და ისე გავუშვებთ კოდს გამოიწვევს ერორს
#print GOA BEST!
print('GOA BEST!')

#თუ სიტყვის დაპრინტვის დროს რომელიც ცვლადში არაა არ დავუწერთ ბრჭყალებს გამოიტანს ერორს
#print(cat)
print('cat')