import React from 'react'

const App = () => {
  return (
    <div>
      <h1>გასაკეთებელი იყო codeyforum სადაც კითხვას სვამს 1 პროგრამისტი დე მეორე შედარებით მაღალი დონის პროგრამისტი, ვინც იცი სცემს პასუხს. გასაკეთებლად კი გამოვიყენეთ: props, map, array და სხვ. ჩემთვის გასაგები იყო ყველა ნაწილი რადგან დეტალურად და კარგად იყო ახსნილი გაუგებარი არ იყო არაფერი მაგრამ map გამოყენება ცოტათი გამიჭირდა საბოლოოდ ამ ახსნის შედეგად პროექტი ძალიან მარტივი და გასაგები გახდა. </h1>
    </div>
  )
}

export default App
