'''კომენტარების სახით დაწერეთ თუ რაში გამოგვადგება სტანდარტები და საუკეთესო პრაქტიკები. ისაუბრეთ ცვლადებზე და კომენტარებზე'''

# სტანდარტები და საუკეთესო პრაქტიკები გამოგვადგება იმაში რომ ჩვენი კოდი გავხადოთ უფრო მარტივად წასაკითხი და დიდი კოდის შექმნისას 
# გაგიმარტივოს იმ ადგილის პოვნა ტუ სად ხარ მაგალითდ შენ შექმენი აპი სადაც დაუშვი ერთი შეცდომა და იცი რა შეცდომაცაა ამის 
# გამოსასწორებლად კი მოგიწევს წაიკითხო კოდი თავიდან ბოლომდე და გაიაზრო თითოეული დეტალი ხოლო კომენტარების მეშვეობით შეგიძლია 
# გვერძე მიუწერო რას გამოსახავს და რა ფუნქციას ასრულებს ეს კოდი ხოლო ცვლადებით კი შეგიძლია ერთიდა იგივე წინადადება
#  რამდენიმეჯერ პატარა სიტყვიტ დაპრინტო.
